tutorials/wfoamMooring/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            (overset fvMotionSolvers sixDoFMooring);

application     overInterDyMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.2;

deltaT          0.001;

writeControl    adjustable;// adjustableRunTime; timeStep;

writeInterval   0.05;

purgeWrite      0;

writeFormat     binary; //ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes; //yes;

adjustTimeStep  yes;

maxCo           0.5; // 5.0
maxAlphaCo      0.5; // 2.0
maxDeltaT       0.01;

functions
{   
    interfaceHeight1
    {
        type            interfaceHeight;
        
        libs            ("libfieldFunctionObjects.so");
        
        locations       ((-3.93 0 0) (-3.25 0 0) (3.25 0 0) (3.75 0 0));
        alpha           alpha.water;
        
        writeControl   timeStep;
        writeInterval  10;
    }
}

// ************************************************************************* //

